{"data":{"markdownRemark":{"html":"<p>In my last post, we went over how to set up Universal Links to allow deep linking in iOS but we never dug into our app's codebase. Now we are going to dive into some of the configurations for iOS to enable deep linking. To do this, we are going to open up your app's codebase and jump into a file called the AppDelegate.m. So what is this file?</p>\n<p>When you create an Xcode project, it automatically creates two classes for you; one called AppDelegate and one called ViewController. The AppDelegate is the entry point to your application from the outside world. It works with the ViewController when the app is launched and the ViewController is responsible for setting up the view.</p>\n<p>First things first, below your last import statement in your AppDelegate.m add in RCTLinkingManager.</p>\n<pre><code>#import &#x3C;React/RCTLinkingManager.h>\n</code></pre>\n<p>And below that paste this into your file:</p>\n<pre><code>- (BOOL)application:(UIApplication *)application openURL:(NSURL *)url\n  sourceApplication:(NSString *)sourceApplication annotation:(id)annotation\n{\n  return [RCTLinkingManager application:application openURL:url\n                      sourceApplication:sourceApplication annotation:annotation];\n}\n\n// Only if your app is using [Universal Links](https://developer.apple.com/library/prerelease/ios/documentation/General/Conceptual/AppSearch/UniversalLinks.html).\n- (BOOL)application:(UIApplication *)application continueUserActivity:(NSUserActivity *)userActivity\n restorationHandler:(void (^)(NSArray * _Nullable))restorationHandler\n{\n return [RCTLinkingManager application:application\n                  continueUserActivity:userActivity\n                    restorationHandler:restorationHandler];\n}\n</code></pre>\n<p>When a user clicks on a universal link, iOS will launch your app and the method <code>application:continueUserActivity:restorationHandler</code> will get called in AppDelegate.m. It will be passed an NSUserActivity object with the webpageURL that the user is trying to access.</p>\n<p><code>application:continueUserActivity:restorationHandler</code>  tells the delegate that the data for continuing an activity is available and the NSUserActivity is a representation of the state of your app at a moment in time.</p>\n<p>So now, our AppDelegate.m knows what to do with Universal links. Great, go try it out.\nYou'll see that when you click on a Universal link your app launches, but you'll also notice, it doesn't quite open up to the exact page you were hoping for. Lastly, to get our iOS deep linking to work we need to tell our app how to handle these different URLs.</p>\n<p>But before we do that, in my next post, I'm going to switch gears and get our Android side up to speed.</p>","frontmatter":{"title":"Deeplinking Part 2(iOS Configuration)"}}},"pageContext":{"slug":"/blogs/deeplinking-pt2/"}}