{"data":{"markdownRemark":{"html":"<p>Mmm.. tacos.</p>\n<p><img src=\"https://mixandmatchmama.com/wp-content/uploads/2018/03/Taco-meme-2.jpg\"></p>\n<p>So believe it or not, this post is more than just talking about my love of tacos, it's actually about Design Patterns -- specifically the Decorator pattern.</p>\n<p>Within the realm of coding, a design pattern is simply a general, reusable solution to a commonly occurring problem within a given context. There are many different patterns used for many different situations so for now, we're just going to focus on the Decorator.</p>\n<p>According to the GoF, the intent of the Decorator pattern is to:</p>\n<blockquote>\n<p>“Attach additional responsibilities to an object dynamically. Decorators provide a flexible alternative to subclassing for extending functionality.”</p>\n</blockquote>\n<p>Sometimes you want to add a responsibility to a individual object, not to the entire class. While Inheritance has its place, it can be very inflexible and can't be controlled by the client. Inheritance may add the functionality you want, but it's also going to add it to every other instance within the subclass and you may not want ALL of those instances to have that functionality. For example, you may have a bunch of tacos, and you might really want some spicy salsa on one of them. But you're a wimp, so you don't want spicy salsa on all of your tacos, instead, you \"decorate\" one taco with the salsa.</p>\n<p>Take a look at this code. Here we have a <code>Taco</code> class that has a price and ingredients.</p>\n<pre><code>class Taco\n  attr_accessor :price, :ingredients\n\n  def initialize(price:1, ingredients: \"tortilla\")\n    @price = price\n        @ingredients = ingredients\n  end\n\nend\n</code></pre>\n<p>That's a pretty boring Taco. Next we want to add ingredients, but we're at some super bougie artisanal Taco shop, so they price every ingredient separately. To do this, let's create some decorators. These decorators forward requests to the component (our taco) and can perform additional actions on our taco.</p>\n<pre><code>class WithGuac\n  attr_accessor :taco\n\n  def initialize(taco)\n    @taco = taco\n  end\n\n  def price\n    taco.price +  2\n  end\n\n  def ingredients\n    taco.ingredients + \", guacamole\"\n  end\nend\n\n\nclass WithBeef\n  attr_accessor :taco\n\n  def initialize(taco)\n    @taco = taco\n  end\n\n  def price\n    taco.price + 1\n  end\n\n  def ingredients\n    taco.ingredients +  \", beef\"\n  end\nend\n</code></pre>\n<p>Here we have created two Decorators, <code>WithBeef</code> and <code>WithGuac</code> (and we honestly should add many more but you get the point) that each take an instance of a <code>taco</code> as an argument. This taco is an object that will be 'enclosed' by the decorator. They each add functionality by adding their individual price and ingredient to the taco's price and ingredients. And the beauty of decorators:</p>\n<blockquote>\n<p>You can nest decorators recursively, allowing an unlimited number of added responsibility.</p>\n</blockquote>\n<p>So before, with inheritance, I'd have to make a TacoWithBeef class and a TacoWithGuac class <em>and then</em> a TacoWithBeefAndGuac class. Now think if this taco was worth eating and had a few more ingredients... that’s a lot of subclasses. Instead we can simply do this:</p>\n<pre><code>taco = Taco.new\ntaco = WithGuac.new(taco)\ntaco = WithBeef.new(taco)\n\nputs taco.ingredients  #=> \"tortilla, guacamole, beef\"\nputs taco.price        #=>  4\n</code></pre>\n<p>In addition to adding functionality to my taco's original methods, a decorator can also add some new functionality. Remember the important takeaway here -- this pattern allows decorators to add functionality without having the subclass depend on the decoration.</p>\n<pre><code>class WithSpicySalsa\n  attr_accessor :taco\n\n  def initialize(taco)\n    @taco = taco\n  end\n\n  def price\n    taco.price + '.5'.to_f\n  end\n\n  def ingredients\n    taco.ingredients + \", spicy salsa\"\n  end\n\n  def spice_level\n     \"This is pretty spicy\"\n  end\nend\n</code></pre>\n<p>Now we're back to our spicy salsa that we only want on that single taco. As you can see there's a new piece of functionality here, the spice_level. Normal tacos don't have that because they start out as just a tortilla. Once a taco is decorated by the<code>WithSpicySalsa</code> class, it now has this functionality, but a taco without salsa doesn't.</p>\n<pre><code>taco = Taco.new\ntaco = WithGuac.new(taco)\nspicy_taco = WithSpicySalsa.new(taco)\n\nputs spicy_taco.spice_level  #=> \"This is pretty spicy\"\nputs taco.spice_level  #=> undefined method `spice_level' for #&#x3C;WithGuac:0x007faad31242a8>\n</code></pre>\n<p>Pretty cool right?\nSo now you're all like \"Cool, Sav... but instead of writing all of these subclasses that I then have to add my taco to in order to add these ingredients and prices, can't I just write one method INSIDE my Taco class to do that?'\"</p>\n<pre><code>def add_ingredient_update_price(ingredient, amt)\n    @ingredients += \", #{ingredient}\"\n    @price += amt\n  end\n\ntaco = Taco.new\ntaco.add_ingredient_update_price( \"lettuce\", 2)\n\nputs taco.ingredients  #=> tortilla, lettuce\n</code></pre>\n<p>Sure, that works. But now lets say your artisanal Taco shop also serves burritos and nachos with these same topping options. Now we have to rewrite that method in our Burrito class and our Nacho class, and that's not very DRY.</p>\n<p>With our decorators we can REUSE that code on our new food group classes.</p>\n<pre><code>class Nachos\n  attr_accessor :price, :ingredients\n\n  def initialize(price = 2, ingredients = \"chips, cheese\")\n    @price = price\n    @ingredients = ingredients\n  end\nend\n\nnachos = Nachos.new\nnachos = WithBeef.new(nachos)\n\nputs nachos.ingredients  #=> chips, cheese, beef\n</code></pre>\n<p>Ok, that was a lot, so let's \"taco\" 'bout it.</p>\n<p><img src=\"https://media.giphy.com/media/xjve2iD3I5Xpe/giphy.gif\"></p>\n<p>That was bad, I know, it won't happen again.</p>\n<p>But really, let's sum up a few points:\nGood things about Decorator Pattern:</p>\n<ul>\n<li>It has more flexibility than static inheritance - responsibilities can be added and removed at runtime, you are able<br>\nto mix and match responsibilities to instances of the subclass AND reuse that code with other classes.</li>\n<li>It's easy to define new kinds of decorators independently from the classes of objects they extend.</li>\n<li>Avoids feature-heavy classes high up in the hierarchy - you can define a simple class and add functionality\nincrementally with Decorator objects.</li>\n</ul>\n<p>Liabilities of the Decorator Pattern:</p>\n<ul>\n<li>A decorator and its component aren't identical, and cannot be relied upon to be identical - you shouldn't rely on object\nidentity when using decorators</li>\n<li>lots of little objects - there are lots of objects that differ only in the way they are interconnected, this can make hard for\nanother developer to learn and debug.</li>\n</ul>","frontmatter":{"title":"Decorating Tacos"}}},"pageContext":{"slug":"/blogs/decorating-tacos/"}}