{"data":{"markdownRemark":{"html":"<p>Google Analytics is used to measure all sort of traffic on websites. It can answer questions like \"How many people visit my website?\", \"What websites send traffic to my website?\", \"What content do my visitors like the most?\" and so on.</p>\n<p>To get started with Google Analytics, you first need to create a free account. Once you have that setup and are signed in you need to set up a property. A property represents your website or app and is the collection point in Analytics for the data from your site or app. You'll need to set up a new property for each site you want to collect data from -- this also generates a Google Analytics ID for each site.</p>\n<p>Each property contains views, which are subsets of reporting data for the property. A View is your access point for reports, you give users access to a view so they can see the reports based on that view's data. For example, you may have three views for your property:</p>\n<ol>\n<li>one to view the data from www.yourdomain.com</li>\n<li>one view of only AdWords traffic to www.yourdomain.com</li>\n<li>one view of only traffic to a subdomain like www.checkout.yourdomain.com</li>\n</ol>\n<p>When you add a new web property to your Analytics account, Analytics generates the tracking code snippet that you need to add to the pages whose data you want to collect. You can use it as it or you can customize it to collect additional data.</p>\n<p>To set up your Analytics tag, you need to find the Google Analytics ID for your property that was mentioned above. To do that:</p>\n<ol>\n<li>Log into your account and click on Admin</li>\n<li>Select the correct Account</li>\n<li>Select the correct Property</li>\n<li>Under Property click on Tracking Info</li>\n<li>Your ID will be at the top under Tracking Code</li>\n</ol>\n<p>Once you have your ID, you will paste this tag right AFTER the <head> tag on each page of your site and replace YOUR<em>GA</em>ID with your ID you just grabbed.</p>\n<pre><code>&#x3C;!-- Global Site Tag (gtag.js) - Google Analytics -->\n&#x3C;script async src=\"https://www.googletagmanager.com/gtag/js?id=YOUR_GA_ID\">&#x3C;/script>\n&#x3C;script>\n  window.dataLayer = window.dataLayer || [];\n  function gtag(){dataLayer.push(arguments);}\n  gtag('js', new Date());\n\n  gtag('config', 'YOUR_GA_ID');\n&#x3C;/script>\n</code></pre>\n<p>Now that you have GA set up, it is time to add GA Events. Events are used to collect data about interactions with your content. An event goal is a goal you define that identifies a specific event as a conversion. Events have each of the following components:</p>\n<ol>\n<li>Category - used to group objects</li>\n<li>Action - used to name the type of event or interaction you want to measure, the action name can be anything you choose.</li>\n<li>all actions are listed independently from parent categories</li>\n<li>a unique event is determined by a unique action name</li>\n<li>try choosing action names that relate to your data categories</li>\n<li>the 'action' doesn't always need to be an action word</li>\n<li>Label (optional) - provides additional information for events you want to categorize</li>\n<li>Value (optional) -  a number used to assign a numeric value to a page object</li>\n</ol>\n<p>ex: Category: \"Videos\"\nAction: \"Play\"\nLabel: \"Baby Monkey\"</p>\n<p>A unique event is an interaction with content by a single user within a single session that can be tracked separately from pageviews or screen views -- it only counts an event with the same category/action/label the first time in one session, total Events metric counts all the events.</p>\n<p>To get started with measurement of GA Events, you can use the gtag.js event command, on a web page where the global site tag has been added, with the following syntax.</p>\n<pre><code>gtag('event', &#x3C;action>, {\n     'event_category' : &#x3C;category>,\n         'event_label' : &#x3C;lablel>,\n         'value' : &#x3C;value>\n });\n</code></pre>","frontmatter":{"title":"Google Analytics"}}},"pageContext":{"slug":"/blogs/google-analytics/"}}