{"data":{"markdownRemark":{"html":"<p>Today I learned a few valuable lessons while deploying some of my old projects to Heroku.</p>\n<ol>\n<li>If you have a Rails app built with newer versions of Ruby and Rails and are using Postgres for your database management, then deploying your app is pretty simple.</li>\n<li>If you have a React app you want to deploy, it takes a bit more configuration to get it all up and running.</li>\n<li>If you have a React app with a Rails api backend, you've got a journey ahead of you.</li>\n</ol>\n<p>Let's quickly go over the first one.</p>\n<h1>Deploying a Rails App</h1>\n<p><strong>1. Making Sure You're Set Up Correctly</strong>\nFirst things first, check to make sure you have up-to-date versions of Ruby and Rails. Ruby should be at least version 2.4.0 and above, Rails should be version 5. You can use <code>ruby -v</code> and <code>rails -v</code> to check those. Next, make sure you are using Postgres and not Sqlite3 for you database management. If you are using Sqlite3, just change out the 'sqlite3' gem for  the 'pg' gem. After switching the gems, go into your database.yml file and make sure you change the adapter for all of the environments to 'postgresql' and name your database. You can check out Heroku's<a href=\"https://devcenter.heroku.com/articles/getting-started-with-rails5\"> website </a>to see exactly what this file should look like. Once that is updated go ahead and <code>bundle install</code>.  </p>\n<p><strong>2. Connect to Heroku</strong>\nNow you are ready to connect to Heroku. First type <code>heroku login</code> into your terminal and put in your credentials (make sure you sign up for a free account first). Once you are connected, it is now time to create a new Heroku app, to do that, type <code>heroku create</code> in the terminal. If you want to change the name of your app you can type <code>heroku apps:rename new_name</code>. You can check that your app has been connected and renamed with <code>git remote -v</code>.</p>\n<p>If you want to use a Heroku app that already exists, you can type<code>heroku git:remote -a my_exiting_app</code>.</p>\n<p><strong>3. Push Your App and Database to Heroku</strong>\nNow that you are connected, you are ready to deploy! Go ahead and use <code>git add .</code>and <code>git commit -m</code> to make sure you commit any changes that you have made since the beginning of this process. Next, enter <code>git push heroku master</code>.  If you run into a problem where Heroku doesn't recognize which programming language you are using, you can tell Heroku what language to use to build the application. You do this by using buildpacks (specific language components that Heroku uses). You can set them to Ruby by using <code>heroku buildpacks:set heroku/rub</code>.  You can set buildpacks for any of the supported languages you need and you can use multiple buildpacks for projects that use more than one language (we'll see this when we get to the react app with a rails api).</p>\n<p>Lastly, we want to migrate the database from the Rails application to Heroku. To do this, run <code>heroku run rake db:migrate</code> and if you have any <code>seed data you can run heroku run rake db:seed</code>.</p>\n<p>To visit your application, you can run <code>heroku open</code>.</p>\n<p>Sometimes you may have some issues with the styling not going through properly, if this happens, check out <code>heroku logs</code> to see what errors come up. Sometimes the issue will be that a static file won't be processed when deployed to Heroku, the best course of action here is to use a CDN vendor to host the static assets.</p>\n<p>IF, you just need your app up and running and aren't concerned with speed or performance then you can go into your config/environments/production.rb file and make these changes:</p>\n<pre><code>config.assets.complie = true\nconfig.serve_static_assests = true\n</code></pre>\n<p>**This is not the recommended what to go about this because it will slow down performance, but it will get up up and running quickly if that is all you need\n**</p>\n<p>Yay! We now have our Rails app up and running on Heroku! Next week I'll go over how to deploy a React app.</p>","frontmatter":{"title":"Deploying to Heroku"}}},"pageContext":{"slug":"/blogs/deploying-to-heroku/"}}